{
  "apa*python": "Python adalah bahasa pemrograman yang ditafsirkan, interaktif, dan berorientasi objek. Ini menggabungkan modul, pengecualian, pengetikan dinamis, tipe data dinamis tingkat sangat tinggi, dan kelas. Python menggabungkan kekuatan luar biasa dengan sintaksis yang sangat jelas. Ini memiliki antarmuka ke banyak panggilan sistem dan perpustakaan, serta berbagai sistem jendela, dan dapat diperluas dalam C atau C ++. Ini juga dapat digunakan sebagai bahasa ekstensi untuk aplikasi yang membutuhkan antarmuka yang dapat diprogram. Akhirnya, Python portabel: ia berjalan pada banyak varian Unix, pada Mac, dan pada Windows 2000 dan yang lebih baru.",
  "apa*python*foundation": "The Python Software Foundation adalah organisasi nirlaba independen yang memegang hak cipta pada Python versi 2.1 dan yang lebih baru. Misi PSF adalah untuk memajukan teknologi open source yang terkait dengan bahasa pemrograman Python dan untuk mempublikasikan penggunaan Python. Halaman beranda PSF ada di https://www.python.org/psf/.",
  "apa*lisensi*memakai*python": "Anda dapat melakukan apa pun yang Anda inginkan dengan sumbernya, selama Anda meninggalkan hak cipta dan menampilkan hak cipta itu dalam dokumentasi apa pun tentang Python yang Anda hasilkan. Jika Anda menghormati aturan hak cipta, boleh saja menggunakan Python untuk penggunaan komersial, menjual salinan Python dalam bentuk sumber atau biner (dimodifikasi atau tidak dimodifikasi), atau untuk menjual produk yang memasukkan Python dalam beberapa bentuk. Kami masih ingin tahu tentang semua penggunaan komersial Python, tentu saja.",
  "python*bagus*untuk": "Python adalah bahasa pemrograman tujuan umum tingkat tinggi yang dapat diterapkan ke banyak kelas masalah yang berbeda. Bahasa ini dilengkapi dengan pustaka standar besar yang mencakup bidang-bidang seperti pemrosesan string (ekspresi reguler, Unicode, penghitungan perbedaan antara file), protokol Internet (HTTP, FTP, SMTP, XML-RPC, POP, IMAP, pemrograman CGI), rekayasa perangkat lunak (pengujian unit, pencatatan, pembuatan profil, penguraian kode Python), dan antarmuka sistem operasi (panggilan sistem, sistem file, soket TCP / IP). Lihatlah daftar isi untuk The Python Standard Library untuk mendapatkan gagasan tentang apa yang tersedia. Berbagai ekstensi pihak ketiga juga tersedia. Konsultasikan Indeks Paket Python untuk menemukan paket yang menarik bagi Anda.",
  "dimana*dokumentasi*python": "Dokumentasi standar untuk versi stabil Python saat ini tersedia di https://docs.python.org/3/. PDF, teks biasa, dan versi HTML yang dapat diunduh juga tersedia di https://docs.python.org/3/download.html.",
  "python*manual": "Ada newsgroup, comp.lang.python, dan milis, python-list. Newsgroup dan milis saling berhubungan satu sama lain - jika Anda dapat membaca berita, tidak perlu berlangganan ke milis. comp.lang.python adalah lalu lintas tinggi, menerima ratusan posting setiap hari, dan pembaca Usenet seringkali lebih mampu mengatasi volume ini.",
  "buku*python": "Ya, ada banyak, dan lebih banyak lagi yang diterbitkan. Lihat wiki python.org di https://wiki.python.org/moin/PythonBooks untuk daftar.",
  "selamat*pagi": "Pagi ada yang bisa kami bantu ?",
  "selamat*siang": "Siang, ada yang bisa kami bantu ?",
  "selamat*malam": "Udah malam aja masih tanya, ada yang bisa kami bantu ?",
  "selamat*sore": "Sore, ada yang bisa kami bantu ?",
  "siapa*kamu": "Halo, saya bot python. Apapun yang kamu pengin tahu tentang python aku juga tahu",
  "kenapa*nama*python": "Guido van Rossum, ketika ia mulai menerapkan Python, juga membaca skrip yang diterbitkan dari \"Monty Python Flying Circus\", sebuah serial komedi BBC dari tahun 1970-an. Van Rossum berpikir dia membutuhkan nama yang pendek, unik, dan sedikit misterius, jadi dia memutuskan untuk memanggil bahasa Python."
}